app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "preference", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "DethDealer"], ["preference", "Pears"], ["created_at", "2017-06-21 19:47:07.629660"], ["updated_at", "2017-06-21 19:47:07.629660"], ["user_id", 1]]
---
  def create
    @profile = Profile.new(params_profile)
    @profile.user_id = current_user.id
      if @profile.save

SELECT  "recipes".* FROM "recipes" LIMIT ?  [["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipes = Recipe.all
    if(Profile.exists?(current_user.id))
      @profile = Profile.find(params[:id])