app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "updated_at", "title", "ingredients") VALUES (?, ?, ?, ?)  [["created_at", "2017-06-21 20:10:39.980506"], ["updated_at", "2017-06-21 20:10:39.980506"], ["title", "Pickled Pears"], ["ingredients", "1 litre/1¾ pints cider or white wine vinegar"]]
UPDATE "recipes" SET "updated_at" = ?, "user_id" = ? WHERE "recipes"."id" = ?  [["updated_at", "2017-06-21 20:34:36.544564"], ["user_id", 1], ["id", 6]]
---
  def create
    @recipe = Recipe.create(recipe_params)
    @recipe.user_id = current_user.id

    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Roast Chicken Update 2.5"], ["updated_at", "2017-07-16 16:35:34.606092"], ["id", 20]]
---
  def update
  @recipe = Recipe.find(params[:id])
  @update = @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 6]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy